
public class VeryImportant {

	public static void main(String[] args) {
		/* 챕터별 중요도
		 * - 아래에 작성된 챕터 중요도는 해당 챕터 내용이 중요하지 않다가
		 *   아니라 학습할 때 우선순위를 정할 때 참고하기 위해 작성한
		 *   것입니다.
		 * 변수 : *****
		 * 연산자 : *****
		 * 조건문 : *****
		 * 반복문 : *****
		 * 배열 : ** (리스트로 대체 가능)
		 * 클래스 : *****
		 *   - 필드/메서드/생성자 : *****
		 *   - 메서드 오버로딩 : ****
		 *   - 접근 제어자 : **(private, public)
		 *   - this : **(편하게 작업)
		 *   - static : *
		 *   - 초기화 순서 : ** (최종 생성자)
		 * 상속 : *****
		 *   - 클래스 형변환 : ***** 
		 *   - 메서드 오버라이딩 : *****
		 *   - 다형성 : ****
		 * 추상 클래스 : *(직접 만들 일은 없고 라이브러리에서 제공하는 클래스들)
		 *   - 추상 메서드 : **** 
		 *   - final : **
		 * 인터페이스 : ****
		 * 
		 * JDK 기본 클래스
		 *   - Object 클래스 : *****
		 *   - String : ***
		 *   - enum : *
		 * 
		 * 컬렉션 프레임워크 : ****
		 *   - List : *****
		 *   - Set : **
		 *   - Map : ****
		 * 
		 * 내부 클래스 : **
		 * 익명 클래스 : ****
		 * 람다식 : **
		 * 스트림 : *
		 * 
		 * 예외처리 : *****
		 * 
		 * 자바 입출력 : **
		 * 
		 * 쓰레드 : **
		 *   
		 */

	}

}
